# ეს ფუნქცია ანგარიშობს, კონსოლიდან მიღებული, დადებითი მთელი რიცხვის შემადგენელ ციფრთა ჯამს.
def calc_digit_sum(num):
    # წარმოვადგინოთ sum ცვლადი 
    sum = 0  
    # while ციკლი ...              
    while num > 0:
        digit = num % 10  # % ნაშთის ოპერაციით, რიცხვის 10-ზე გაყოფის შედეგად მივიღებთ ერთეულს
        sum += digit      # sum = sum + digit
        num //= 10        # number = number // 10 - მთელზე გაყოფის ოპერაციით მივიღებთ ათეულებამდე დამრგვალებულ რიცხვს
    return sum            # ფუნქცია აგროვებს sum  
# ... ფუნქციის განსაზვრის დასასრული 

# ფუნქციონალის დემონსტრაცია:

# სათაურის წარმოდგენა ...
print("= "*31)
print("5.1.2 კონსოლიდან მიღებული, დადებითი მთელი რიცხვის შემადგენელ\n\nციფრთა ჯამის გამომთვლელი პაროგრამა")
print("_ "*31)
# სათაურის წარმოდგენა ...

# შეყვანილი ინფორმაციის ვალიდაცია ...
while True:
    number = input("\nშეიყვანეთ მთელი რიცხვი:  ")
    if number.isdigit():
        #თუ შეყვანილი, დადებითი მთელი რიცხვია ... 
        num = int(number)
        break
    else:
       print("\nგთხოვთ შეიყვანოთ დადებითი მთელი რიცხვი. \n")
# შეყვანილი ინფორმაციის ვალიდაცია ...
                       
result = calc_digit_sum(num)

print (f"\n{num}-ის შემადგენელ ციფრთა ჯამია:  {result}")
print("_ "*31)