# სათაურის წარმოდგენა ...
print("_ "*31)
print("\n5.1.2  რიცხვის შემადგენელ ციფრთა ჯამის გამომთვლელი პროგრამა")
print("_ "*31)
# სათაურის წარმოდგენა ...

# რიცხვის კონსოლში შეტანა ...
# number ცვლადს, ვანიჭებს მომხმარებლის მიერ შეყვანიილ მნიშვნელობას
number = int(input("\nშეიყვანეთ მთელი რიცხვი:  "))
# რიცხვის კონსოლში შეტანა ...
num = number

# რიცხვის ციფრებად დაყოფა და შეკრება:
# წარმოვადგინოთ sum ცვლადი 
sum = 0  

# while ციკლი ...              
while number > 0:
   digit = number % 10  # % ნაშთის ოპერაციით, რიცხვის 10-ზე გაყოფის შედეგად მივიღებთ ერთეულს
   sum += digit         # sum = sum + digit
   number //= 10        # number = number // 10 - მთელზე გაყოფის ოპერაციით მივიღებთ ათეულებამდე დამრგვალებულ რიცხვს

print(f"\n{num}-ის ციფრთა ჯამია:  {sum}")
