
# 3. დაწერეთ პითონის პროგრამა, რომელიც მიიღებს ტელეფონის ნომერს და regex-ით 
# შეამოწმებს შეყვანილი ნომერი იცავს თუ არა "(123) 456-789" ფორმატს, 
# თუ იცავს დააბრუნეთ შეყნვაილი ტელეფონის ნომერი, წინააღმდეგ შემთხვევაში გამოიტანეთ "Invalid format" ტექსტი.

# მინიშნება: სრული დამთხვევისთვის გამოიყენეთ .fullmatch() მეთოდი re მოდულიდან.

import re

# მიიღე ტელეფონის ნომერი
ph_num = input("Enter a phone number: ")

# Regex ჩარჩო - ფორმატი "(123) 456-789"
ptrn = r"\(\d{3}\) \d{3}-\d{3}"

# fullmatch() სრული დამთხვევის შემოწმება
if re.fullmatch(ptrn, ph_num):
    print(ph_num)
else:
    print("Invalid format")
