# 1. კონსოლიდან შეიტანეთ ორი რიცხვი და დაბეჭდეთ ყველა არითმეტიკული ოპერაცია (მიმატება, გამოკლება, გამრავლება, ჩვეუკებრივი გაყოფა, მთელზე გაყოფა, ნაშთის აღება, ახარისხება).

print("მათემატიკური ოპერაციები ორ რიცხვზე, გთხოვთ მიყვეთ ინსტრუქციას\n")
a = int(input ("შეიყვანეთ პირველი რიცხვი: "))
b = int(input ("შეიყვანეთ მეორეი რიცხვი: "))
c = a+b
print(f"ჯამი: {a:>10}+{b}={c}")
c = a-b
print(f"სხვაობა: {a:>7}-{b}={c}")
c = a*b
print(f"ნამრავლი: {a:>6}*{b}={c}")
c = a/b
print(f"განაყოფი: {a:>6}/{b}={c}")
c = a//b
print(f"მთელზე გაყოფა:{a:>2}//{b}={c}")
c = a%b
print(f"ნაშთი:{a:>10}%{b}={c}")
c = a**b
print(f"ახარისეა: {a:>6}**{b}={c}")
print("\n")


# 2. დაწერეთ პროგრამა რომბის ფართობის გამოსათვლელად. მომხმარებელს კლავიატურის გამოყენებით შეაქვს ორი დიაგონალის სიგრძე.

print("რომბის ფართობის გამოთვლა დიაგონალებით:")
diag1 = eval(input("შეიყვანეთ პირველი დიაგონალის სიგრძე: "))
diag2 = eval(input("შეიყვანეთ მეორე დიაგონალის სიგრძე: "))
s = (diag1*diag2)/2
print(f"რომბის ფართობი: ({diag1}*{diag2})/2={s}\n")

# 3. მომხმარებელის შეაქვს მეტრების რაოდენობა. დაბეჭდეთ შესაბამისი მნიშვნელობა სანტიმეტრებში, დეციმეტრებში, მილიმეტრებში, მილში.

print("სიგრძის საზომი ერთეულების მთარგმნელი:\n")
m = eval(input("შეიყვანეთ სიგრძე მეტრებში: "))
cm = m*100
dcm = m*10
mm = m*1000
mi = m/1609.344 
print(f"სანტიმეტრი: {cm}")
print(f"დეციმეტრი: {dcm}")
print(f"მილიმეტრი: {mm}")
print(f"მილი: {mi}\n")

# 4. დაწერეთ პროგრამა, რომელიც ითვლის სამკუთხედის ფართობს. მომხმარებელს კონსოლიდან შეყავს სამკუთხედის სიმაღლისა და ფუძის მნიშვნელობა.

print("სამკუთხედის ფართობის გამოთვლა: \n")
h = eval(input("შეიყვანეთ სიმაღლის მნიშვნელობა: "))
p = eval(input("- ფუძის მნიშვნელობა: "))
s = (h*p)/2
print(f"{h}*{p}/2={s}\n")

# 5. კონსოლიდან შეიტანეთ ორნიშნა რიცხვი და დაბეჭდეთ ციფრთა ჯამი.

print("რიცხვის შემადგენელ ციფრთა ჯამი: \n")
num = input("შეიყვანეთ ორნიშნა რიცხვი: ")
n1 = int(num[0])
n2 = int(num[1])
numsum = n1+n2
print(f"{n1}+{n2}={numsum}\n")

#5.1 ორნიშნა რიცხვის ციფრთა ჯამი მეორე მეთოდით.
print("მეორე მეთოდი")
num = int(input("შეიყვანეთ რიცხვი: "))
numsum = (num % 10) + ((num // 10) % 10)
print("ციფრთა ჯამი:", numsum)
