#4. დაწერეთ პითონის ფუნქცია, რომელიც მიიღებს  ორ პარამეტრს, 
# პირველს სტრიქონს და მეორეს სიმბოლოს. ფუნქციამ უნდა მოძებნოს 
# სტრიქონში რამდენჯერ მეორდება პარამეტრად მიღებული სიმბოლო და 
# დააბრუნოს  მისი რაოდენობა.

#შევქმნათ გლობალური ცვლადები, სადაც შევიყვანთ სიტყვას და საძიებო სიმბოლოს მნიშვნელობას:

string=input("\n შეიყვანეთ სასურველი სიტყვა: ")
char = input ("\n შეიყვანე საძიებო სიმბოლო: ")

def count_chars(string, char):
    return string.count(char)
print(f"\n {count_chars(string, char)}")