# 2. დაწერეთ პითონის ფუნქცია, რომელიც მიიღებს პარამეტრად ორ სტრიქონს და შეამოწმებს 
# არის თუ არა სტრიქონები ანაგრამები (ანაგრამი არის სიტყვა ან შესიტყვება, რომელიც 
# წარმოიქმნება სხვა სიტყვის ან შესიტყვების ასოების გადაადგილებით). მაგ.: race და care ანაგრამებია.


# შევიყვანოთ სასურველი სიტყვები [შევქმნათ გლობალური ცვლადები]

str1 = input("\n შეიყვანეთ პირველი სიტყვა: ")
str2 = input("\n შეიყვანე მეორე სიტყვა: ")

# შევქმნათ ფუნქცია: 

def are_anagrams(str1, str2):
    
    if sorted(str1) == sorted(str2):
        print("\n მოცემული სიტყვები წარმოადგენს ანაგრამას!")
    else:
        print("\n აქ ანაგრამა არ არის!")

# გამოვიძახოთ ფუნქცია: 
are_anagrams(str1, str2)