# 5. დაწერეთ პითონის კოდი, რომელიც იღებს სტრიქონს,
# სტრიქონი გადაყავს ბაიტებში, ბეჭდავს მნიშვნელობას და შემდეგ კი
# გადაყავს ბაიტებიდან სტრიქონში და ბეჭდავს სტრიქონს.


# სტრიქონი
str = input("შეიყვანეთ სიტყვა: ")

# თითოეული სიმბოლოს გადაყვანა Unicode კოდში და მათი ბეჭდვა
byte_str = []
for char in str:
    byte_i = ord(char)  # თითოეული სიმბოლოს Unicode კოდის მიღება
    byte_str.append(byte_i)  # მიღებული მნიშვნელობის დამატება სიაში

print("\nUnicode კოდები:", byte_str)

# Unicode კოდებიდან სტრიქონის აწყობა
string_str = ''
for byte in byte_str:
    char = chr(byte)  # თითოეული Unicode კოდიდან სიმბოლოს მიღება
    string_str += char  # მიღებული სიმბოლოს დამატება სტრიქონში

print("\nსტრიქონი:", string_str)
