#4. დაწერეთ პითონის პროგრამა, რომელიც მიიღებს მუდმივად რიცხვებს. 
# შექმენით საწყისი ცვლადი total_sum = 0, შეამოწმეთ რიცხვი თუ დადებითია, 
# მხოლოდ მაშინ დაუმატეთ total_sum ცვლადს. 
# ეს პროცესი გაგრძელდეს იქამდე სანამ მომხმარებელი არ შეიყვანს 'sum' ტექსტს, 
# რის შემდეგაც დაიბეჭდება შეყვანილი დადებითი რიცხვების ჯამი.

# საწყისი ცვლადი, სადაც დადებითი რიცხვების ჯამი შეინახება
sum = 0

# შევქმნათ ციკლი, რომელიც იმუშავებს, ვიდრე str მიიღებს მნიშვნელობას - "sum".

while str != "sum": 
    # პროგრამაში შემოდის სტრიქონი
    str = input("\nშეიყვანეთ რიცხვი ან 'sum' ჯამის დასათვლელად: ") 
    # მოწმდება შეყვანილი სიმბოლოები
    for i in str: 
    # ამ შემთხვევაში i არის დროებითი ცვლადი რომელიც მიიღებს str ცვლადში შეყვანილი სიმბოლოების მნიშვნელობას.
        # მომწმდება დამთხვევა 
        if not (i in "0123456789.sum"):            
            print("\nგთხოვთ, შეიყვანოთ დადებითი რიცხვი ან 'sum'.")
        elif str != "sum":
            # ტექსტის რიცხვად გარდაქმნა და დაჯამება
            num = float(str)
            if num > 0:
                sum += num
        break

print("\nდადებითი რიცხვების ჯამია:", sum)