
# 1. შექმენით სია num_list [44, 23, 11, 8, 20, 56, 33, 55], in-ის გამოყენებით დაწერეთ პროგრამა რომელიც შეამოწმებს თქვენს მიერ შეტანილი რიცხვი არის თუ არა სიაში.

# მაგ.:
# Enter a number: 56
# The number in list
#===========================
# Enter a number: 45
# The number not in list
print("შეყვანილი რიცხვის შემოწმება, არის თუ არა სიაში\n")
num_li = [44, 23, 11, 8, 20, 56, 33, 55]

# რიცხვის შეყვანა
num = int(input("შეიყვანე ნებისმიერი რიცხვი: "))

# შემოწმება, არის თუ არა რიცხვი სიაში
if num in num_li:
    print(f"იღბლიანი ხარ, რიცხვი სიაშია!\n{num_li}")
else:
    print(f"ეჰ, კიდევ სცადე! რიცხვი არ არის სიაში.\n{num_li}")
    

# 2. დაწერეთ პროგრამა რომელიც შეამოწმებს თქვენს მიერ შეყვანილი რიცხვის ლუწობასა და კენტობას. თუ რიცხვი ლუწია გამოიტანეთ ტექსტი 'even' თუ კენტია 'odd'.

# მაგ.:
# Enter an integer: 25
# The number is odd
#===========================
# Enter an integer: 36
# The number is even
print("\nაბა კენტი თუ ლუწი\n")
# მომხმარებლის მიერ რიცხვის შეყვანა
a = int(input("შეიყვანე ნებისმიერი რიცხვი გარდა ნულისა: "))

# შემოწმება, რიცხვი ლუწია თუ კენტი
if a!=0:
    if a % 2 == 0:
        print("ლუწია")
    else:
        print("კენტია")
else: 
    print("ხო გითხარი ნული არათქო!")

# 3. შექმენით ორი სტრინგის ტიპის ცვლადი st1 და st2, შეადარეთ ისინი is-ის გამოყენებით, თუ ემთხვევა გამოიტანეთ ტექსტი "Same object", წინააღმდეგ შემთხვევაში "Different object"
print("\n ეს რომ გაიგო ჩახედე კოდს ;)")
# სტრინგის ტიპის ცვლადები
st1 = "დამაკოპირე"
st2 = "დამაკოპირე"
# სტრინგების შედარება
if st1 is st2:
    print(" Same object")
else:
    print(" Different object")


# 4. შექმენით სია num_list [44, 23, 11, 8, 20, 56, 33, 55], შეიტანეთ რიცხვი და დაწერეთ შემდეგი პირობა:
# * თუ შეტანილი რიცხვი მეტია სიაში არსებულ მე-3 ელემენტზე და ნაკლებია ბოლო ელემენტზე გამოიტანეთ ტექსტი "More than list elements";
# * თუ შეტანილი რიცხვი უდრის სიის მე-6 ელემენტს გამოიტანეთ ტექსტი "Equal";
# * სხვა ნებისმიერ შემთხვევაში გამოიტანეთ ტექსტი "None of the conditions were met".
# რიცხვის შეტანის ოპერაციისთვის გამოიყენეთ input მეთოდი.

# მაგ.:
# Enter a number: 105
# None of the conditions were met
# #===========================
# Enter a number: 40
# More than list elements
# #===========================
# Enter a number: 56
# Equal
print("\n მანიპულაცია სიაზე, დეტალებისთვის ჩახედე კოდს")
num_list = [44, 23, 11, 8, 20, 56, 33, 55]

# რიცხვის შეყვანა
num = int(input(" შეიყვანე ნებისმიერი რიცხვი: "))

# სიის ელემენტები
iii_el = num_list[2]  # მე-3 ელემენტი
vi_el = num_list[5]  # მე-6 ელემენტი
last_el = num_list[-1]  # ბოლო ელემენტი

# ლოგიკური ოპერატორით პირობის შემოწმება
if iii_el < num < last_el:
    print(" More than list elements")
elif num == vi_el:
    print(" Equal")
else:
    print(" None of the conditions were met")
print(f" აჰა სია: {num_list}")