#4. დაწერეთ პითონის პროგრამა, რომელიც მიიღებს მუდმივად რიცხვებს. 
# შექმენით საწყისი ცვლადი total_sum = 0, შეამოწმეთ რიცხვი თუ დადებითია, 
# მხოლოდ მაშინ დაუმატეთ total_sum ცვლადს. 
# ეს პროცესი გაგრძელდეს იქამდე სანამ მომხმარებელი არ შეიყვანს 'sum' ტექსტს, 
# რის შემდეგაც დაიბეჭდება შეყვანილი დადებითი რიცხვების ჯამი.

# საწყისი ცვლადი, სადაც დადებითი რიცხვების ჯამი შეინახება
sum = 0

# შევქმნათ უასარულო ციკლი და საჭიროებისამებრ შევწყვითოთ break-ით.
while True:
    
    str = input("\nშეიყვანეთ რიცხვი ან 'sum' ჯამის დასათვლელად: ") # პროგრამაში შემოდის სტრიქონი

    if str == "sum": # თუ str = 'sum', ბეჭდავს ჯამს და ციკლი წყდება break-ით
        print("დადებითი რიცხვების ჯამი არის:", sum)
        break

    # შეყვანილი სიმბოლოები მხოლოდ ციფრებია?!
    # შევქმნათ პირობა for ციკლისთვის. 
    valid_str = True
    for i in str: # ამ შემთხვევაში i არის დროებითი ცვლადი რომელიც მიიღებს str ცვლადში შეყვანილი სიმბოლოების მნიშვნელობას.
        if not (i in "0123456789."): # მომწმდება დამთხვევა
            valid_str = False # თუ დამთხვევა ვერ იქნა ნაპოვნი, for ციკლი შეწყდება 
            break

    # ვამოწმებთ, თუ შეყვანილი ტექსტი დადებითი რიცხვი არ არის, ყველაფერს ვიწყებთ თავიდან.
    if not valid_str:
        print("გთხოვთ, შეიყვანოთ დადებითი რიცხვი ან 'sum'.")
        continue

    # ტექსტის გარდაქმნა რიცხვად და დაჯამება
    num = float(str)
    sum += num

