#3. დაწერეთ პითონის პროგრამა თამაშისთვის, რომელიც მუდმივად სთხოვს მომხმარებელს გამოიცნოს წინასწარ განსაზღვრული რიცხვი. 
# როდესაც მომხმარებელი გამოიცნობს სწორ რიცხვს, დაასრულებს პროგრამა მუშაობას.

# წინასწარ განსაზღვრული რიცხვი

from random import randint
secret_number = randint(1, 100)
i=1
print("\nგამოიცანი ჩაფიქრებული რიცხვი 1-დან 100-მდე ")
# ციკლი
while True:
    guess = int(eval(input(f"\nცდა ნომერი - {i} გამოიცანი რიცხვი: ")))
    
    if guess == secret_number:
        print(f"გილოცავთ! სწორად გამოიცანით. ეს არის {guess}")
        break
    elif guess > secret_number:
        print("ნაკლებია ჩანაფიქრი, კიდევ სცადე! ;)")
    else:
        print("ჩანაფიქრი უფრო მაღალია, სცადე უფრო დიდი რიცხვი!")
    i += 1
print("\nთამაში დასრულებულია!")       
