valid_simbols = ['ა','ბ','გ','დ','ე','ვ','ზ','თ','ი','კ','ლ','მ','ნ','ო','პ','ჟ','რ','ს','ტ','უ','ფ','ქ','ღ','ყ','შ','ჩ','ც','ძ','წ','ჭ','ხ','ჯ','ჰ']
word_list = [
    {"word": "ზუგდიდი", "quest": "ნაპოლეონის ნიღაბი ინახება სამ ქალაქში: ლონდონი, პარისი და ... გამოიცანით მესამე ქალაქი!"},
    {"word":"ნონა", "quest":"გამოიცანით მსოფლიოს მასშტაბით, მამაკაცებში პირველი გროსმეისტერი ქალის სახელი!"},
    {"word":"კაშკაშა", "quest":"რას ნიშნავს \"ხვიჩა\" მეგრულ ენაზე?"},
    {"word":"ფოტოსინთეზი", "quest":"მცენარეების მიერ მზის სინათლის ენერგიის გამოყენებით ორგანული ნივთიერებების სინთეზის პროცესი."},
    {"word":"ევერესტი", "quest":"დაასახელე მთა მაჰალანგურ-ჰიმალაის მთის სისტემაში, ნეპალისა და ჩინეთის საზღვარზე."}   
]
