# 1. დაწერეთ პითონის პროგრამა, რომელიც დასაწყისში შექმნის ცარიელ სიას ([]), 
# თუ მომხარებელი შეიყვანს სიმბოლო 'a'-ს, 
# ნიშნავს რომ უნდა დაამატოთ სიაში რიცხვი; თუ აკრიფა 'r', სიიდან უნა წაიშალოს რიცხვი; 
# 'e'-ს შეტანისას პროგრამამ უნდა დაასრულოს მუშაობა. მიღებული შედეგი დაბეჭდეთ კონსოლში.

# a – append

# r – remove

# e – exit

# გამოიყენეთ მხოლოდ ეს ბრძანებები და მოახდინეთ სიაზე ზემოქმედება.

# ცარიელი სია
lst = []

while True:
    command = input("შეიყვანეთ 'a' დასამატებლად, 'r' წასაშლელად, ან 'e' გამოსასვლელად: ")
    
    if command == 'a':
        number = int(input("შეიყვანეთ დასამატებელი რიცხვი: "))
        lst.append(number)
        print(f"განახლებული სია: {lst}")
    
    elif command == 'r':
        if lst:
            removed_number = lst.pop()
            print(f"წაშლილი რიცხვი: {removed_number}")
        else:
            print("სიაში არ არის ელემენტები")
        print(f"განახლებული სია: {lst}")
    
    elif command == 'e':
        print("პროგრამა დასრულდა.")
        break
    
    else:
        print("არასწორი ბრძანება, სცადეთ ხელახლა.")
