#1. შექმენით გლობალური ცვლადი int_list = [10,20,30,40] და დაწერეთ პითონის ფუნქცია, 
# რომელიც  მიიღებს რიცხვს პარამეტრად და გლობალურ int_list სიაში ჩაამატებს პარამეტრად მიღებულ რიცხვს.


int_list = [10, 20, 30, 40] # გლობალური ცვლადის შექმნა
print (int_list) # გლობალური ცვლადის წარმოდგენა
number = int(input("\nშეიყვანეთ სასურველი პარამეტრი: ")) # სასურველი პარამეტრის, კონსოლიდან შეყვანის შესაძლებლობის შექმნა.

def add_to_list(number):
  global int_list  # გლობალური ცვლადის გამოცხადება ფუნქციის შიგნით
  int_list.append(number) # გლობალურ ცვლადს მიემატება სასურველი პარამეტრი
  return int_list

# add_to_list(number)
# print(f"\n{int_list}")  # გამოიტანს: [10, 20, 30, 40, სასურველ პარამეტრი]
print(add_to_list(number))